tap "everettjf/tap"
tap "hreinssondev/brewstation"
tap "muxy-app/tap"
tap "oven-sh/bun"
tap "penso/arbor"

# Core shell and CLI workflow
brew "atuin"
brew "bat"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "jq"
brew "lazygit"
brew "micro"
brew "mise"
brew "ripgrep"
brew "starship"
brew "uv"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Development tools
brew "difftastic"
brew "gh"
brew "gotop"
brew "htop"
brew "hugo"
brew "llmfit"
brew "miller"
brew "mole"
brew "node"
brew "pandoc"
brew "python@3.14"
brew "swiftformat"
brew "swiftlint"
brew "tokei"
brew "xsv"
brew "oven-sh/bun/bun"

# Desktop apps and fonts
cask "penso/arbor/arbor"
cask "bitwarden"
cask "caffeine"
cask "codex"
cask "copilot-cli"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "linearmouse"
cask "muxy-app/tap/muxy"
cask "obsidian"
cask "telegram"
cask "whatsapp"
cask "zed"

# Language/package-manager installed CLIs
uv "basedpyright"
uv "ruff"
npm "@earendil-works/pi-coding-agent"
npm "create-dmg"
npm "hunkdiff"
npm "pnpm"
